{
    "Date": {
        "Year": 2023,
        "Month": 12,
        "Day": 31
    },
    "Title": "New Year, New Me!",
    "SignOff": "See You Next Year,",
    "SignedName": "The Creator",
    "Route":"new-year-new-me",
    "Tags":["goals", "gamedev"],
    "Body": {
        "P1": {
            "Type": "Text",
            "Content": "It's that time of year again. Recovering from visiting family, hyped up on two much sugar and new hopes, we sit down and proclaim that <span class=\"italics\">this<span> is the year we will get abs. Just like last year, and the year before that, and the year..."
        },
        "P2": {
            "Type": "Text",
            "Content": "Regardless, my new years Resolutions are not about physical fitness. Like many people, I have a multitude of half-made projects. I leap from creative outlet to creative outlet like a rabbit, but I don't actually finish anything. This year I have decided to actually make headway, hence TheCreatorsOutlet. There is a pitiful, half-made koi fish who deserved my attention, a backlog of recipes, and seven half-scoped video games."
        },
        "P3": {
            "Type": "Text",
            "Content": "GDC 2024 is coming up, and I have nothing to show for it. With three months to go, I don't have hopes to be ready in time. So this year, my goal is to make a solid start towards GDC 2025."
        },
        "P4": {
            "Type": "Text",
            "Content": "To that end, I have three goals. First, I will ship at least one, small game. This will prove that I can ship games. I have my eye of \"Running Out of Time\", a pixel puzzler of possibilities that I've been meaning to make. I'll be livestreaming its development on Twitch, because I believe in the accountability of showing up for twelve hours a week. Second, I will prepare a demo for a game that I believe justifies using a real publisher. This is the demo that I want to bring to GDC. Three, I will do at least two game jams. This will help me talk to other developers, and the quick turnaround should teach me something about just making a game. They will also give me something to talk about at GDC, since I have the networking skills of a stinky ferret."
        }
    }
}