{
    "Date": {
        "Year": 2024,
        "Month": 1,
        "Day": 7
    },
    "Title": "Smart Traffic",
    "SignOff": "Kindly Ignore the Sound of My Voice,",
    "SignedName": "The Creator",
    "Route":"smart-traffic",
    "Tags":["software", "college"],
    "Body": {
        "P1": {
            "Type": "Text",
            "Content": "For my first blog, I'm going to throw back to a project on my resume. It was a group project that won a 2022 engineering competition when I was in undergraduate."
        },
        "P2": {
            "Type": "Text",
            "Content": "The inspiration behind this project is the traffic light from hell. In one direction, there is a traffic-laden road. The cars line so far back, that the next traffic light overflows. In the other direction, there is a small road. I am sure a car would pass by if you waited long enough. And yet, for some reason, the busy roads get 30 seconds of time compared to the light roads 2 minutes 30 seconds. This traffic light is the bane of all good things. Think of how much time I could save in a school year. 3 quarters. 11 weeks per quarter. 5 days per week. An extra 2 minutes per passby. 2 passbys per day. That's 660 minutes waiting at an unneccesary traffic light. I was doing this math as a joke, but in hindsight that's 11 hours a year waiting for nothing and nobody. This isn't even just a car problem. All of the pedestrians, of whom in one direction are numerous, have to wait for the passing of cars that do not exist."
        },
        "P3": {
            "Type": "Text",
            "Content": "But I digress. The important part is that it inspired this projecet. We really wanted to win, so we went big! We narrowed all our ideas to eight: simple, machine learning, priority mode, override mode, night mode, safe walking mode, broken mode and surprise mode. The biggest one was machine learning mode. We analyzed the plates themselves, and the frequencies the cars went over them. From there, the program determined the proper amount of time to let each side go. It will analyze whether the plate has \"broken\" by determining that no usable data has passed in the last time frame. That way, the system still works even with a few faults. All the modes were a lot of work to build, and there's more description about them on the site itself."
        },
        "P4": {
            "Type":"Link",
            "Text":"See the Control System Here!",
            "Link":"https://smart-traffic-embedded-systems.glitch.me/"
        },
        "P5": {
            "Type": "Video",
            "Link": "https://www.youtube.com/embed/naZrCyXZW6E"
        }
    }
}